{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "NoGrassUnderBuildings",
			"Children": [
				{
					"Source":
					{
						"Text": "Controls grass cleanup beneath buildings and whether it returns after dismantling."
					},
					"Translation":
					{
						"Text": "التحكم في تنظيف العشب الموجود أسفل المباني وما إذا كان يعود بعد التفكيك."
					},
					"Key": "ConfigDescription"
				},
				{
					"Source":
					{
						"Text": "Earliest time temporary grass can begin returning after the final covering building is dismantled."
					},
					"Translation":
					{
						"Text": "في أقرب وقت يمكن أن يبدأ العشب المؤقت في العودة بعد تفكيك المبنى النهائي الذي يغطيه."
					},
					"Key": "RegrowthMinTooltip"
				},
				{
					"Source":
					{
						"Text": "Extra clearing distance above and below covered building geometry."
					},
					"Translation":
					{
						"Text": "مسافة خلوص إضافية فوق وتحت هندسة المبنى المغطاة."
					},
					"Key": "VerticalBufferTooltip"
				},
				{
					"Source":
					{
						"Text": "Extra grass-clearing distance around a building footprint."
					},
					"Translation":
					{
						"Text": "مسافة إضافية لإزالة العشب حول بصمة المبنى."
					},
					"Key": "HorizontalBufferTooltip"
				},
				{
					"Source":
					{
						"Text": "Gradual edge-to-center regrowth"
					},
					"Translation":
					{
						"Text": "إعادة النمو التدريجي من الحافة إلى المركز"
					},
					"Key": "GradualRegrowthName"
				},
				{
					"Source":
					{
						"Text": "Horizontal buffer (meters)"
					},
					"Translation":
					{
						"Text": "المخزن المؤقت الأفقي (متر)"
					},
					"Key": "HorizontalBufferName"
				},
				{
					"Source":
					{
						"Text": "Latest time temporary grass can return. Values below the minimum are treated as the minimum."
					},
					"Translation":
					{
						"Text": "آخر وقت يمكن أن يعود فيه العشب المؤقت. يتم التعامل مع القيم الأقل من الحد الأدنى على أنها الحد الأدنى."
					},
					"Key": "RegrowthMaxTooltip"
				},
				{
					"Source":
					{
						"Text": "No Grass Under Buildings"
					},
					"Translation":
					{
						"Text": "لا العشب تحت المباني"
					},
					"Key": "ConfigName"
				},
				{
					"Source":
					{
						"Text": "Regrow grass after dismantling"
					},
					"Translation":
					{
						"Text": "إعادة نمو العشب بعد التفكيك"
					},
					"Key": "RegrowGrassName"
				},
				{
					"Source":
					{
						"Text": "Regrowth maximum (seconds)"
					},
					"Translation":
					{
						"Text": "إعادة النمو الأقصى (ثواني)"
					},
					"Key": "RegrowthMaxName"
				},
				{
					"Source":
					{
						"Text": "Regrowth minimum (seconds)"
					},
					"Translation":
					{
						"Text": "الحد الأدنى لإعادة النمو (ثواني)"
					},
					"Key": "RegrowthMinName"
				},
				{
					"Source":
					{
						"Text": "Returns generated cliff grass in inexpensive staged waves instead of one obvious pop."
					},
					"Translation":
					{
						"Text": "ولدت العوائد عشبًا منحدرًا في موجات مرحلية غير مكلفة بدلاً من فرقعة واحدة واضحة."
					},
					"Key": "GradualRegrowthTooltip"
				},
				{
					"Source":
					{
						"Text": "Vertical buffer (meters)"
					},
					"Translation":
					{
						"Text": "المخزن المؤقت العمودي (متر)"
					},
					"Key": "VerticalBufferName"
				},
				{
					"Source":
					{
						"Text": "When enabled, hidden grass returns after the configured delay. Disable it to keep grass cleared beneath newly placed buildings after they are dismantled. Trees, bushes, resource plants, and other foliage are never permanently removed by this mod."
					},
					"Translation":
					{
						"Text": "عند التمكين، يعود العشب المخفي بعد التأخير الذي تم تكوينه. قم بتعطيله للحفاظ على إزالة العشب أسفل المباني التي تم وضعها حديثًا بعد تفكيكها. لا تتم إزالة الأشجار والشجيرات ونباتات الموارد وأوراق الشجر الأخرى بشكل دائم بواسطة هذا الوضع."
					},
					"Key": "RegrowGrassTooltip"
				}
			]
		}
	]
}